test_data/safecharge_checkout.yml

---
    casename1: "SafeCharge跳转支付接口1"
    urls1: "https://test-v2.pacypay.com/gateway/Interface"
    kyes: "6sTX81178s87ozyB9idUCeF64Ybz66"
    head: "application/x-www-form-urlencoded; charset=utf-8"
    params1:
        merchantNo: "21677"
        subAccount: "21677002"
        transactionId: ""
        amount: "12.56"
        currency: "USD"
        returnUrl: "https://test-v2.pacypay.com/paytest/pages/jump.html"
        notifyUrl: "http://test.com/notify"
        cancelUrl: "https://test-v2.pacypay.com/paytest/pages/cancel.html"
        consumerId: "123456"
        consumerLevel: 1
        cardType: ""
        defaultLang: "zh_CN"
        products: "iphone#,#NUM1#,#230.00#,#1#;#ipad#,#NUM2#,#290.00#,#"
        remark: "test"
        streetNumber: 1040
        merchantBizId: "test"
        firstName: "test"
        lastName: "my"
        address: "833 Cheung Sha Wan Road"
        city: "New York City"
        state: "NY"
        country: "US"
        zipCode: 10000
        email: "abcde@gmail.com"
        phone: "13500000000"
        consigneeFirstName: "san"
        consigneeLastName: "zhang"
        consigneeAddress: "833 Cheung Sha Wan Road"
        consigneeCity: "New York City"
        consigneeState: "NY"
        consigneeCountry: "US"
        consigneeZip: 100000
        consigneeEmail: "test@163.com"
        consigneePhone: "15000000000"
        platform: "test"
        sign: ""
    casename2: "SafeCharge跳转支付接口2"
    urls2: "https://test-v2.pacypay.com/gateway/SendInterface"
    params2:
        paymentMethodId: "1"
        tradeNo: ""
        transactionType: ""
        cardExpireYear: "2022"
        cardExpireMonth: "12"
        cardSecurityCode: "123"
        cardNumber: "4000025906274039"
        firstName: "wan"
        lastName: "test"
        country_label: "United States"
        country: "US"
        state: "NY"
        address: "833 Cheung Sha Wan Road"
        city: "New York City"
        zip: "10000"
        email: "abcde@gmail.com"
        phone: "13500000000"
        shipFirstName: "test"
        shipLastName: "my"
        twice: "twice"
...